Autodesk.Revit.DB.Structure.BoundaryConditionsType
This enum declares type of BoundaryConditions.
Since:
2011

Autodesk.Revit.DB.Structure.BoundaryConditionsType.Area
Area Boundary Conditions

Autodesk.Revit.DB.Structure.BoundaryConditionsType.Line
Line Boundary Conditions

Autodesk.Revit.DB.Structure.BoundaryConditionsType.Point
Point Boundary Conditions